const arr1 = [1, 2, 3],
  arr2 = [4, 5, 6],
  arr3 = [...new Set([...arr1, ...arr2])];

console.log(arr3);

const arr4 = [1, 2, 3];
const reversed = arr4.reverse();
console.log(reversed);

const arr5 = [1, 2, 3];
arr5.push(4, 5, 6);
console.log(arr5);

const arr6 = [1, 2, 3];
arr6.unshift(4, 5, 6);
console.log(arr6);

const strArr = ["js", "css", "jq"];
console.log(strArr[0]);
console.log(strArr.shift());

const strArr2 = ["js", "css", "jq"];
console.log(strArr2.slice(-1).pop());

const arr7 = [1, 2, 3, 4, 5];
const arr8 = arr7.slice(0, 3);
console.log(arr8);

const arr9 = [1, 2, 3, 4, 5];
const arr10 = arr9.slice(3, 5);
console.log(arr10);

const arr11 = [1, 2, 3, 4, 5];
arr11.splice(1, 2);
console.log(arr11);

const arr12 = [1, 2, 3, 4, 5];
const arr13 = arr12.slice(1, -1);
console.log(arr13);

const arr14 = [1, 2, 3, 4, 5];
arr14.splice(3, 0, "a", "b", "c");
console.log(arr14);

const arr15 = [1, 2, 3, 4, 5];
arr15.splice(1, 0, "a", "b");
arr15.splice(6, 8, "c", 5, "e");
console.log(arr15);

const arr16 = [3, 4, 1, 2, 7];
arr16.sort();
console.log(arr16);

const arr17 = [5, 6, 7, 8, 9].reduce((a, b) => a + b, 0);
console.log(arr17);

const arr18 = [5, 6, 7, 8, 9];
const arr19 = arr18.map((elem) => {
  return elem * elem;
});
console.log(arr19);

const arr20 = [1, -3, 5, 6, -7, 8, 9, -11];
console.log(
  arr20.filter((elem) => {
    return elem < 0;
  })
);

const arr21 = [1, -3, 5, 6, -7, 8, 9, -11];
console.log(
  arr21.filter((elem) => {
    return elem % 2 == 0;
  })
);

const arrStr = ["aaa", "aaaqqq", "zzzqq", "zz", "qsaa", "q", "az"];
console.log(
  arrStr.filter((elem) => {
    return elem.length > 5;
  })
);

const protoArr = [1, 2, [3, 4], 5, [6, 7]];
console.log(
  protoArr.filter((elem) => {
    return Array.isArray(elem);
  })
);

const arr22 = [5, -3, 6, -5, 0, -7, 8, 9];
const arr23 = arr22.filter((elem) => {
  return elem < 0;
});
console.log(arr23.length);

// Для решения всех этих задач используйте методы массивов
// https://learn.javascript.ru/array-methods

// 1. Даны два массива: [1, 2, 3] и [4, 5, 6]. Объедините их вместе.

// 2. Дан массив [1, 2, 3]. Сделайте из него массив [3, 2, 1].

// 3. Дан массив [1, 2, 3]. Добавьте ему в конец элементы 4, 5, 6.

// 4. Дан массив [1, 2, 3]. Добавьте ему в начало элементы 4, 5, 6.

// 5. Дан массив ['js', 'css', 'jq']. Выведите на экран
// первый элемент.

// 6. Дан массив ['js', 'css', 'jq']. Выведите на экран
// последний элемент.

// 7. Дан массив [1, 2, 3, 4, 5]. С помощью метода запишите в
// новый массив элементы [1, 2, 3].

// 8. Дан массив [1, 2, 3, 4, 5]. С помощью метода запишите в
// новый массив элементы [4, 5].

// 9. Дан массив [1, 2, 3, 4, 5]. С помощью метода преобразуйте
// массив в [1, 4, 5].

// 10. Дан массив [1, 2, 3, 4, 5]. С помощью метода запишите в
// новый массив элементы [2, 3, 4].

// 11. Дан массив [1, 2, 3, 4, 5]. С помощью метода сделайте из
// него массив [1, 2, 3, 'a', 'b', 'c', 4, 5].

// 12. Дан массив [1, 2, 3, 4, 5]. С помощью метода сделайте из
// него массив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].

// 13. Дан массив [3, 4, 1, 2, 7]. Отсортируйте его.

// 14. Дан массив с числами [5, 6, 7, 8, 9]. Найдите сумму этих
// чисел.

// 15. Дан массив с числами [5, 6, 7, 8, 9]. Сделайте из него
// массив, состоящий из квадратов этих чисел.

// 16. Дан массив с числами [1,-3, 5, 6,-7, 8, 9,-11]. Оставьте
// в нем только отрицательные числа.

// 17. Дан массив с числами [1,-3, 5, 6,-7, 8, 9,-11]. Оставьте
//  в нем только четные числа.

// 18. Дан массив со строками ['aaa', 'aaaqqq', 'zzzqq', 'zz',
// 'qsaa', 'q', 'az']. Оставьте в нем только те строки, длина
// которых больше 5-ти символов.

// 19. Дан массив, в нем могут быть обычные элементы и подмассивы,
// например [1, 2, [3, 4], 5, [6, 7]]. Оставьте в нем только подмассивы.

// 20. Дан массив с числами [5,-3, 6,-5, 0,-7, 8, 9]. Посчитайте
// количество отрицательных чисел в этом массиве.
